In [1]:
import numpy as np
import pandas as pd

In [2]:
movies_df = pd.read_csv('./data/movies_clean.csv')
reviews_df = pd.read_csv('./data/train_data.csv')

del movies_df['Unnamed: 0']
del reviews_df['Unnamed: 0']

In [3]:
movies_df.head()

,movie_id,movie,genre,date,1800's,1900's,2000's,History,News,Horror,...,Fantasy,Romance,Game-Show,Action,Documentary,Animation,Comedy,Short,Western,Thriller
0,8,Edison Kinetoscopic Record of a Sneeze (1894),Documentary|Short,1894,1,0,0,0,0,0,...,0,0,0,0,1,0,0,1,0,0
1,10,La sortie des usines Lumière (1895),Documentary|Short,1895,1,0,0,0,0,0,...,0,0,0,0,1,0,0,1,0,0
2,12,The Arrival of a Train (1896),Documentary|Short,1896,1,0,0,0,0,0,...,0,0,0,0,1,0,0,1,0,0
3,25,The Oxford and Cambridge University Boat Race ...,NaN,1895,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,91,Le manoir du diable (1896),Short|Horror,1896,1,0,0,0,0,1,...,0,0,0,0,0,0,0,1,0,0

In [4]:
reviews_df.head()

,user_id,movie_id,rating,timestamp,date,month_1,month_2,month_3,month_4,month_5,...,month_9,month_10,month_11,month_12,year_2013,year_2014,year_2015,year_2016,year_2017,year_2018
0,37287,2171847,6,1362062307,2013-02-28 14:38:27,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
1,33140,444778,8,1362062624,2013-02-28 14:43:44,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
2,6338,1411238,6,1362062838,2013-02-28 14:47:18,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
3,43691,1496422,7,1362063503,2013-02-28 14:58:23,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
4,33799,118799,5,1362063653,2013-02-28 15:00:53,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0

### creating ranked df

In [8]:
rating_mean = reviews_df.groupby('movie_id')['rating'].mean()
rating_count = reviews_df.groupby('movie_id')['rating'].count()
rating_latest = reviews_df.groupby('movie_id')['timestamp'].max()

In [16]:
rating_latest[20629]

1362633757

In [22]:
movies_df

,movie_id,movie,genre,date,1800's,1900's,2000's,History,News,Horror,...,Fantasy,Romance,Game-Show,Action,Documentary,Animation,Comedy,Short,Western,Thriller
0,8,Edison Kinetoscopic Record of a Sneeze (1894),Documentary|Short,1894,1,0,0,0,0,0,...,0,0,0,0,1,0,0,1,0,0
1,10,La sortie des usines Lumière (1895),Documentary|Short,1895,1,0,0,0,0,0,...,0,0,0,0,1,0,0,1,0,0
2,12,The Arrival of a Train (1896),Documentary|Short,1896,1,0,0,0,0,0,...,0,0,0,0,1,0,0,1,0,0
3,25,The Oxford and Cambridge University Boat Race ...,NaN,1895,1,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,91,Le manoir du diable (1896),Short|Horror,1896,1,0,0,0,0,1,...,0,0,0,0,0,0,0,1,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
31240,8335880,Loro 2 (2018),Biography,2018,0,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
31241,8342748,Hari Kondabolu: Warn Your Relatives (2018),Comedy,2018,0,0,1,0,0,0,...,0,0,0,0,0,0,1,0,0,0
31242,8342946,Tig Notaro: Happy To Be Here (2018),Comedy,2018,0,0,1,0,0,0,...,0,0,0,0,0,0,1,0,0,0
31243,8402090,Cumali Ceber 2 (2018),Comedy,2018,0,0,1,0,0,0,...,0,0,0,0,0,0,1,0,0,0
31244,8439854,Lust Stories (2018),Drama,2018,0,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [34]:
def create_ranked_df(movies_df: pd.DataFrame = movies_df, reviews_df: pd.DataFrame = reviews_df):
    rating_mean = reviews_df.groupby('movie_id')['rating'].mean()
    rating_count = reviews_df.groupby('movie_id')['rating'].count()
    rating_latest = reviews_df.groupby('movie_id')['timestamp'].max()
    rating_df = pd.DataFrame({"mean": rating_mean, "count": rating_count, "latest_ts": rating_latest})
    # rating_df['movie_id'] = rating_df.index

    ranked_movie = movies_df.merge(rating_df, how='left', on='movie_id', left_index=True)
    ranked_movie.sort_values(["mean","count","latest_ts"], ascending=False, inplace=True)
    ranked_movie = ranked_movie[ranked_movie['count'] > 4][["movie", "mean","count","latest_ts"]]

    return ranked_movie

In [35]:
create_ranked_df()

                               movie      mean  count     latest_ts
421.0              Goodfellas (1990)  9.666667    9.0  1.363098e+09
1550.0          Step Brothers (2008)  9.600000    5.0  1.363266e+09
771.0         American Beauty (1999)  9.600000    5.0  1.363108e+09
1404.0    There Will Be Blood (2007)  9.600000    5.0  1.363088e+09
1834.0            Gran Torino (2008)  9.600000    5.0  1.363067e+09
...                              ...       ...    ...           ...
2565.0  Paranormal Activity 4 (2012)  4.333333   12.0  1.362982e+09
2323.0           Lovely Molly (2011)  3.777778    9.0  1.363307e+09
1966.0               Movie 43 (2013)  3.714286    7.0  1.362860e+09
1732.0       The Darkest Hour (2011)  3.600000    5.0  1.363200e+09
2145.0                Skyline (2010)  2.166667    6.0  1.362871e+09

[252 rows x 4 columns]